DebtManagment/src/DataProcessors/ОбработкаПодбораПоАдресу/ОбработкаПодбораПоАдресу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаПодбораПоАдресу</name>
</mdclass:DataProcessor>

DebtManagment/src/InformationRegisters/ДолгиДолжников/ДолгиДолжников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолгиДолжников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДолжника</name>
    <type>
      <types>EnumRef.СтатусыДолжника</types>
    </type>
  </resources>
  <dimensions>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/InformationRegisters/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРаботыСДолгом</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Catalogs/Должники/Должники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Должники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДолжника</name>
    <type>
      <types>EnumRef.СтатусыДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>EnumRef.СемейноеПоложение</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.ВидыОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДолжника</name>
    <type>
      <types>EnumRef.СостоянияДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойРасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОГенеральногоДиректора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>CatalogRef.Адреса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Соцсети</name>
    <attributes>
      <name>АктуальностьКонтакта</name>
      <type>
        <types>EnumRef.АктуальностьКонтакта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>202</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСоцСети</name>
      <type>
        <types>CatalogRef.Соцсети</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаКонтакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусКонтакта</name>
      <type>
        <types>EnumRef.СтатусыКонтактаДолжника</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DebtManagment/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>СправочникДолжники</name>
      <description>Справочник должники</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Справочник контактные лица</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Справочник контрагенты</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Справочник организации</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DebtManagment/src/DataProcessors/ОбработкаПодбораПоАдресу/Forms/Форма/Module.bsl
&НаСервере
Процедура ПодборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
 ОткрытьФорму("Справочник.Адреса.ФормаВыбора", ПараметрыПодбора, Элементы.ТаблицаАдресов);
КонецПроцедуры

&НаСервере
Процедура ТаблицаАдресовОбработкаВыбораНаСервере(ВыбранноеЗначение)
	// Вставить содержимое обработчика. 
	 Для Каждого вЗнч Из ВыбранноеЗначение Цикл
 Если ТаблицаАдресов.НайтиСтроки(Новый Структура("Адрес", вЗнч)).Количество() = 0 Тогда
 нСтр = ТаблицаАдресов.Добавить();
 нСтр.Адрес = вЗнч; 
 нСтр.Наименование=вЗнч.ПолноеНаименование();
 
 //нСтр.Предмет = вЗнч.ПроизводимыйПродукт;
 КонецЕсли;
 КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАдресовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
 
 //ИтоговаяТаблицаОбработкаВыбораНаСервере(ВыбранноеЗначение);
	ТаблицаАдресовОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика. 
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолгиДолжников.Должник КАК Должник,
		|	ДолгиДолжников.Долг КАК Долг,
		|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом
		|ПОМЕСТИТЬ ТаблицаДолжники
		|ИЗ
		|	РегистрСведений.ДолгиДолжников КАК ДолгиДолжников
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(&НаДату, ) КАК СтатусыРаботыСДолгомСрезПоследних
		|		ПО ДолгиДолжников.Долг = СтатусыРаботыСДолгомСрезПоследних.Долг
		|			И (СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом В (&СписокСтатусов))
		|ГДЕ
		|	ДолгиДолжников.Долг.ДоговорКонтрагента В(&СписокДоговоров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолжникиКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ТаблицаДолжники.Долг КАК Долг,
		|	ТаблицаДолжники.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом,
		|	ДолжникиКонтактнаяИнформация.Представление КАК Представление,
		|	ДолжникиКонтактнаяИнформация.Вид КАК Вид
		|ИЗ
		|	Справочник.Должники.КонтактнаяИнформация КАК ДолжникиКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДолжники КАК ТаблицаДолжники
		|		ПО ДолжникиКонтактнаяИнформация.Ссылка = ТаблицаДолжники.Должник
		|ГДЕ
		|	ДолжникиКонтактнаяИнформация.Адрес В ИЕРАРХИИ(&СписокАдресов)
		|	И ДолжникиКонтактнаяИнформация.Вид В(&СписокВидов)";

	
	Запрос.УстановитьПараметр("СписокАдресов", ПолучитьСписокАдресовДляЗаполнения());
	Запрос.УстановитьПараметр("СписокВидов", ПолучитьМассивВидовАдресовДляЗаполнения());
   	Запрос.УстановитьПараметр("СписокДоговоров",ПолучитьСписокДоговоровДляЗаполнения());
		Запрос.УстановитьПараметр("СписокСтатусов",ПолучитьМассивСтатусовДляЗаполнения());
	Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
                                         
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи 
		
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		СтрокаРезультат.Должник =ВыборкаДетальныеЗаписи.Ссылка; 
		СтрокаРезультат.ВидАдреса = ВыборкаДетальныеЗаписи.Вид;
		СтрокаРезультат.Адрес = ВыборкаДетальныеЗаписи.Представление;
		СтрокаРезультат.Долг = ВыборкаДетальныеЗаписи.Долг;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры 
&НаСервере
Функция ПолучитьСписокАдресовДляЗаполнения()
	СписокАдресов = ТаблицаАдресов.Выгрузить().ВыгрузитьКолонку("Адрес");
	Возврат СписокАдресов;
КонецФункции
&НаСервере
Функция ПолучитьСписокДоговоровДляЗаполнения()
	СписокДоговоров = ТаблицаДоговоров.Выгрузить().ВыгрузитьКолонку("Договор");
	Возврат СписокДоговоров;
КонецФункции

&НаСервере
 Функция ПолучитьМассивСтатусовДляЗаполнения()
	МассивСтатусовДляЗаполнения =НОвый Массив;
	Для Каждого Элемент из СписокСтатусовРаботыСДолгом цикл
		Если Элемент.Пометка тогда
			МассивСтатусовДляЗаполнения.Добавить(Элемент.Значение);
		КонецЕсли;	
	КонецЦикла;	
		 Возврат МассивСтатусовДляЗаполнения ;
КонецФункции

&НаСервере
Функция ПолучитьМассивВидовАдресовДляЗаполнения()
	МассивВидовАдресовДляЗаполнения =НОвый Массив;
	Для Каждого Элемент из СписокВидовАдресов цикл
		Если Элемент.Пометка тогда
			МассивВидовАдресовДляЗаполнения.Добавить(Элемент.Значение);
		КонецЕсли;	
	КонецЦикла;	
		 Возврат МассивВидовАдресовДляЗаполнения ;
КонецФункции

//Функция ПолучитьМассивСтатусовДляЗаполнения()
//	МассивСтатусовДляЗаполнения =НОвый Массив;
//	Для Каждого Элемент из СписокСтатусовРаботыСДолгом цикл
//		Если Элемент.Пометка тогда
//			МассивСтатусовДляЗаполнения.Добавить(Элемент.Значение);
//		КонецЕсли;	
//	КонецЦикла;	
//		 Возврат МассивСтатусовДляЗаполнения ;
//КонецФункции


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(); 
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРезультат;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика  
ЗаполнитьСписокВидовАдресов();
ЗаполнитьСписокСтатусовРаботыСДолгом();
КонецПроцедуры  

 
&НаСервере	
Процедура ЗаполнитьСписокСтатусовРаботыСДолгом()
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтатусыРаботыСДолгом.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.СтатусыРаботыСДолгом КАК СтатусыРаботыСДолгом";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		СписокСтатусовРаботыСДолгом.Добавить(РезультатЗапроса.Ссылка);
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьСписокВидовАдресов()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
		|	ВидыКонтактнойИнформации.Представление КАК Представление
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &Родитель
		|	И ВидыКонтактнойИнформации.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.ВидыКонтактнойИнформации.СправочникДолжники);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
	Пока РезультатЗапроса.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи                  Представление
		СписокВидовАдресов.Добавить(РезультатЗапроса.Ссылка,РезультатЗапроса.Представление);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры	

&НаСервере
Процедура ПодборДоговорНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодборДоговор(Команда) 
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
 	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыПодбора, Элементы.ТаблицаДоговоров);

	ПодборДоговорНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаДоговоровОбработкаВыбораНаСервере(ВыбранноеЗначение)  
		 Для Каждого вЗнч Из ВыбранноеЗначение Цикл
 Если ТаблицаДоговоров.НайтиСтроки(Новый Структура("Договор", вЗнч)).Количество() = 0 Тогда
 нСтр = ТаблицаДоговоров.Добавить();
 нСтр.Договор = вЗнч; 
 нСтр.Контрагент=вЗнч.Владелец;
 нСтр.СтатусРаботы=вЗнч.СтатусДействия;
 //нСтр.Предмет = вЗнч.ПроизводимыйПродукт;
 КонецЕсли;
 КонецЦикла;

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоговоровОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ТаблицаДоговоровОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ТЕст()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДолгиДолжников.Должник КАК Должник,
	//	|	ДолгиДолжников.Долг КАК Долг,
	//	|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом
	//	|ПОМЕСТИТЬ ТаблицаДолжники
	//	|ИЗ
	//	|	РегистрСведений.ДолгиДолжников КАК ДолгиДолжников
	//	|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(&НаДату, ) КАК СтатусыРаботыСДолгомСрезПоследних
	//	|		ПО ДолгиДолжников.Долг = СтатусыРаботыСДолгомСрезПоследних.Долг
	//	|			И (СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом В (&СписокСтатусов))
	//	|ГДЕ
	//	|	ДолгиДолжников.Долг.ДоговорКонтрагента В(&СписокДоговоров)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДолжникиКонтактнаяИнформация.Ссылка КАК Ссылка,
	//	|	ТаблицаДолжники.Долг КАК Долг,
	//	|	ТаблицаДолжники.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом,
	//	|	ДолжникиКонтактнаяИнформация.Представление КАК Представление,
	//	|	ДолжникиКонтактнаяИнформация.Вид КАК Вид
	//	|ИЗ
	//	|	Справочник.Должники.КонтактнаяИнформация КАК ДолжникиКонтактнаяИнформация
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДолжники КАК ТаблицаДолжники
	//	|		ПО ДолжникиКонтактнаяИнформация.Ссылка = ТаблицаДолжники.Должник
	//	|ГДЕ
	//	|	ДолжникиКонтактнаяИнформация.Адрес В ИЕРАРХИИ(&СписокАдресов)
	//	|	И ДолжникиКонтактнаяИнформация.Вид В(&СписокВидов)";
	//
	//Запрос.УстановитьПараметр("НаДату", НаДату);
	//Запрос.УстановитьПараметр("СписокАдресов", СписокАдресов);
	//Запрос.УстановитьПараметр("СписокВидов", СписокВидов);
	//Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	//Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




КонецПроцедуры
